<a href="https://colab.research.google.com/github/irfanizzath/Dubai-Real-Estate/blob/main/data_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Dubai Real Estate Data**


**Data Preprocessing**

In [1]:
import pandas as pd
import matplotlib.pyplot as pl
from matplotlib import RcParams
import numpy as np
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('/content/Transactions.csv', engine='python', encoding='utf-8', on_bad_lines='skip')
pd.set_option('display.max_colwidth', None)

In [3]:
n = []
for i in df.columns:
  if '_ar' not in i[-3:]:
    n.append(i)
df = df[n]

In [4]:
df.columns = df.columns.str.replace('_en$', '', regex=True)

In [5]:
df.shape

(1661875, 32)

In [6]:
df.isnull().sum()

transaction_id                0
procedure_id                  0
trans_group_id                0
trans_group                   0
procedure_name                0
instance_date                 0
property_type_id              0
property_type                 0
property_sub_type_id     334347
property_sub_type        334347
property_usage                0
reg_type_id                   0
reg_type                      0
area_id                       0
area_name                     0
building_name            479561
project_number           456139
project_name             456139
master_project           225661
nearest_landmark         320582
nearest_metro            501631
nearest_mall             511398
rooms                    357962
has_parking                   0
procedure_area                0
actual_worth                  0
meter_sale_price              0
rent_value              1625339
meter_rent_price        1625339
no_of_parties_role_1        969
no_of_parties_role_2        969
no_of_parties_role_3        969
dtype: int64

In [8]:
developer_map = {
    # ---------------- EMAAR ----------------
    'Emaar': [
        'Downtown Dubai', 'Emirates Hills', 'Dubai Hills', 'Dubai Hills Estate',
        'Arabian Ranches', 'Arabian Ranches II', 'Arabian Ranches III',
        'The Springs', 'The Meadows', 'The Lakes', 'The Greens', 'The Views',
        'Dubai Marina', 'The Residences', 'Burj Khalifa', 'Boulevard',
        'Creek Harbour', 'Dubai Creek Harbour', 'Dubai Hills -',
        'Emaar South', "Emaar's Street Of Dreams"
    ],

    # ---------------- DAMAC ----------------
    'Damac': [
        'DAMAC Hills', 'DAMAC Hills 2', 'DAMAC Lagoons', 'Akoya', 'Akoya Oxygen'
    ],

    # ---------------- NAKHEEL ----------------
    'Nakheel': [
        'Palm Jumeirah', 'Palm Jabal Ali', 'Jumeirah Islands', 'Jumeirah Park',
        'Jumeirah Heights', 'Jumeirah Village Circle', 'Jumeirah Village Triangle',
        'Discovery Gardens', 'The Gardens', 'Al Furjan', 'International City',
        'Deira Islands', 'Veneto', 'The World', 'Palm Deira'
    ],

    # ---------------- SOBHA ----------------
    'Sobha': ['Sobha Hartland', 'Sobha Reserve', 'Sobha One'],

    # ---------------- MERAAS ----------------
    'Meraas': [
        'City Walk', 'Bluewaters Island', 'La Mer', 'Jumeira Bay', 'Pearl Jumeira',
        'Boxpark', 'Nikki Beach', 'Al Wasl District', 'Jumeirah Garden City'
    ],

    # ---------------- DUBAI PROPERTIES (DP) ----------------
    'Dubai Properties': [
        'Mudon', 'Remraam', 'The Villa', 'Business Bay', 'Jaddaf Waterfront',
        'Culture Village', 'Marasi Business Bay', 'Dubai Wharf', 'Manazel Al Khor',
        'Dubai Land Residence Complex', 'Madinat Badr', 'Al Waha Villas'
    ],

    # ---------------- NSHAMA ----------------
    'Nshama': ['Town Square'],

    # ---------------- MAJID AL FUTTAIM ----------------
    'Majid Al Futtaim': ['Tilal Al Ghaf'],

    # ---------------- WASL ----------------
    'Wasl': ['Wasl 1', 'Wasl Gate', 'Wasl District', 'Al Wasl District'],

    # ---------------- MEYDAN ----------------
    'Meydan': [
        'Meydan One Community', 'Meydan Racecourse Community', 'Mohammed Bin Rashid AL Maktoum City',
        'Mohammed Bin Rashid AL Maktoum District 11', 'Mohammed Bin Rashid AL Maktoum District -1',
        'Hadaeq Sheikh Mohammed Bin Rashid', 'Nad Al Sheba Gardens'
    ],

    # ---------------- FALCON CITY ----------------
    'Falcon City': ['Falcon City'],

    # ---------------- DUBAI SOUTH ----------------
    'Dubai South': [
        'Dubai South', 'Dubai World Central', 'Dubai South Residential District'
    ],

    # ---------------- DUBAI SILICON OASIS ----------------
    'Dubai Silicon Oasis Authority': [
        'Silicon Oasis', 'Dubai Digital Park'
    ],

    # ---------------- TECOM GROUP ----------------
    'TECOM Group': [
        'Barsha Heights', 'Dubai Internet City', 'Dubai Media City', 'Dubiotech',
        'Dubai Science Park', 'International Media Production Zone',
        'Dubai Outsource City', 'Knowledge Village', 'Dubai Studio City', 'TECOM Site A',
        'TECOM Site B', 'TECOM Site C', 'TECOM Site D'
    ],

    # ---------------- DUBAI INDUSTRIAL CITY ----------------
    'Dubai Industrial City': [
        'Dubai Industrial City', 'Jabal Ali Industrial', 'Jabal Ali Industrial Development'
    ],

    # ---------------- DUBAI INVESTMENTS ----------------
    'Dubai Investments': ['Dubai Investments Park', 'Dubai Investment Park First', 'Dubai Investment Park Second'],

    # ---------------- DUBAI HOLDING ----------------
    'Dubai Holding': [
        'Dubai Design District', 'Dubai Health Care City Phase 1', 'Dubai Health Care City Phase 2',
        'Dubai Science Park', 'Dubai Studio City', 'Global Village', 'Business Park',
        'Dubai Industrial City'
    ],

    # ---------------- DUBAI PROPERTIES (PART OF DH) ----------------
    'Dubai Properties (DH)': [
        'Dubai Wharf', 'Manazel Al Khor', 'Mudon', 'The Villa', 'Remraam', 'Business Bay'
    ],

    # ---------------- UNION PROPERTIES ----------------
    'Union Properties': ['Motor City', 'Green Community'],

    # ---------------- DANUBE ----------------
    'Danube': [
        'WARSAN FIRST DEVELOPMENT', 'Olivz', 'Skyz', 'Petalz', 'Glamz', 'Resortz', 'Lawnz'
    ],

    # ---------------- AZIZI ----------------
    'Azizi Developments': [
        'Al Furjan', 'Meydan', 'Dubai Healthcare City', 'Palm Jumeirah', 'Jebel Ali Village'
    ],

    # ---------------- DEYAAR ----------------
    'Deyaar': [
        'Al Barsha South', 'Al Barsha Heights', 'Dubai Silicon Oasis'
    ],

    # ---------------- TILAL AL GHAF (MAF) ----------------
    'Majid Al Futtaim': ['Tilal Al Ghaf'],

    # ---------------- OTHER DEVELOPERS ----------------
    'Dubai Maritime City Authority': ['Dubai Maritime City'],
    'Limitless': ['Downtown Jebel Ali', 'Tijara Town'],
    'Mizin': ['Liwan', 'Arjan'],
    'Tameer': ['Dubailand'],
    'MAG': ['MAG City', 'Meydan District 7'],
    'Omniyat': ['Business Bay', 'Marasi Bay'],
    'Select Group': ['Dubai Marina', 'Business Bay'],
    'Ellington': ['Meydan', 'JVC'],
    'Danube': ['Olivz', 'Skyz', 'Glamz', 'WARSAN FIRST DEVELOPMENT'],
    'Triplanet': ['Elite Residences', 'Elite Sports City'],
    'Tiger': ['Al Furjan', 'JVC', 'Business Bay'],
    'Binghatti': ['JVC', 'Business Bay'],
    'Diyar': ['Dubai Silicon Oasis'],
    'Zarooni': ['Jumeirah Village Circle']
}


import numpy as np
import pandas as pd

def get_developer(project):
    if pd.isna(project):
        return np.nan
    for dev, keywords in developer_map.items():
        for word in keywords:
            if word.lower() in project.lower():
                return dev
    return 'Other'

df['developer_name'] = df['master_project'].apply(get_developer)

In [10]:
df.columns

Index(['transaction_id', 'procedure_id', 'trans_group_id', 'trans_group',
       'procedure_name', 'instance_date', 'property_type_id', 'property_type',
       'property_sub_type_id', 'property_sub_type', 'property_usage',
       'reg_type_id', 'reg_type', 'area_id', 'area_name', 'building_name',
       'project_number', 'project_name', 'master_project', 'nearest_landmark',
       'nearest_metro', 'nearest_mall', 'rooms', 'has_parking',
       'procedure_area', 'actual_worth', 'meter_sale_price', 'rent_value',
       'meter_rent_price', 'no_of_parties_role_1', 'no_of_parties_role_2',
       'no_of_parties_role_3', 'developer_name'],
      dtype='object')

In [11]:
# --- Binary flags ---
df['is_near_metro'] = np.where(df['nearest_metro'].notna(), 1, 0)
df['is_near_mall'] = np.where(df['nearest_mall'].notna(), 1, 0)

In [12]:
df['rooms'].value_counts()

rooms
1 B/R          452056
2 B/R          315119
Studio         229901
3 B/R          175391
Office          58800
4 B/R           56463
Shop             6705
5 B/R            6345
PENTHOUSE        1579
Single Room       790
6 B/R             354
Store             320
7 B/R              59
GYM                21
8 B/R               4
9 B/R               4
10 B/R              2
Name: count, dtype: int64

In [13]:

# --- 2. Handle missing values ---
# filling with median per area or global median
df['instance_date'] = pd.to_datetime(df['instance_date'], errors='coerce')
df['instance_date'].fillna(df['instance_date'].median(), inplace=True)

# year and month
df['year'] = df['instance_date'].dt.year
df['month'] = df['instance_date'].dt.month

df['rooms'] = df['rooms'].fillna('Unknown')

# Property sub type NaNs
df['property_sub_type'] = df['property_sub_type'].fillna('Unknown')

def clean_room_category(x):

    x = x.strip().lower()

    # Commercial categories
    commercial_terms = ['office', 'shop', 'store', 'gym']
    if any(term in x for term in commercial_terms):
        return 'Commercial'

    # Merge similar categories
    if 'single' in x:
        return 'Studio'
    if 'studio' in x:
        return 'Studio'
    if 'penthouse' in x:
        return 'Penthouse'

    # Bedroom numbers
    for i in range(1, 11):
        if f'{i}' in x:
            return f'{i} Bedroom'

    return 'Other'


def rooms_to_numeric(x):
    mapping = {
        'Studio': 0.5,
        '1 Bedroom': 1,
        '2 Bedroom': 2,
        '3 Bedroom': 3,
        '4 Bedroom': 4,
        'Penthouse': 4,
        '5 Bedroom': 5,
        '6 Bedroom': 6,
        '7 Bedroom': 7,
        '8 Bedroom': 8,
        '9 Bedroom': 9,
        '10 Bedroom': 10,
        'Commercial': 0,
        'Other': 0, # Map 'Other' category to 0
    }
    return mapping.get(x, 0)

df['rooms'] = df['rooms'].apply(clean_room_category)
df['rooms_numeric'] = df['rooms'].apply(rooms_to_numeric)

In [14]:
df['rooms'].value_counts()

rooms
1 Bedroom     452058
Other         357962
2 Bedroom     315119
Studio        230691
3 Bedroom     175391
Commercial     65846
4 Bedroom      56463
5 Bedroom       6345
Penthouse       1579
6 Bedroom        354
7 Bedroom         59
8 Bedroom          4
9 Bedroom          4
Name: count, dtype: int64

In [15]:
df['property_sub_type'].value_counts()

property_sub_type
Flat                  1052621
Unknown                334347
Villa                  144949
Office                  70252
Hotel Apartment         27739
Shop                    17092
Hotel Rooms             12789
Workshop                  556
Stacked Townhouses        522
Store                     320
Building                  269
Warehouse                 162
Clinic                     68
Show Rooms                 66
Hotel                      44
Sized Partition            43
Gymnasium                  30
Parking                     4
Unit                        2
Name: count, dtype: int64

In [16]:
df['property_usage'].value_counts()

property_usage
Residential                              1398566
Commercial                                191407
Hospitality                                40602
Other                                      16751
Industrial                                  8033
Multi-Use                                   4030
Agricultural                                1147
Storage                                      701
Residential / Commercial                     621
Industrial / Commercial                       12
Industrial / Commercial / Residential          5
Name: count, dtype: int64

In [17]:
df = df.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

In [18]:
# ---  Merging low-count categories into 'Mixed-Use' ---
df['property_usage'] = df['property_usage'].replace({
    'Other': 'Mixed-Use',
    'Residential / Commercial': 'Mixed-Use',
    'Multi-Use': 'Mixed-Use'
})

# --- Dropping irrelevant categories ---
drop_categories = [
    'Industrial',
    'Agricultural',
    'Industrial / Commercial',
    'Storage',
    'Industrial / Commercial / Residential'
]

df = df[~df['property_usage'].isin(drop_categories)]

print(df['property_usage'].value_counts())

property_usage
Residential    1398566
Commercial      191407
Hospitality      40602
Mixed-Use        21402
Name: count, dtype: int64

In [19]:
df.shape

(1651977, 38)

In [20]:
df['property_sub_type'] = df.apply(
    lambda row: row['property_type'] if row['property_sub_type'] == 'Unknown' else row['property_sub_type'],
    axis=1)

subtype_mapping = {
    'Hotel Rooms': 'Hotel Apartment',
    'Stacked Townhouses': 'Villa',
    'Clinic': 'Commercial',
    'Show Rooms': 'Commercial',
    'Hotel': 'Hotel Apartment',
    'Sized Partition': 'Other',
    'Gymnasium': 'Commercial',
    'Parking': 'Commercial',
    'Unit': 'Commercial',
    'Office': 'Commercial',
    'Shop': 'Commercial'
}

# Mapping
df['property_sub_type'] = df['property_sub_type'].replace(subtype_mapping)

# Replacing Unknown with property_type_en
df['property_sub_type'] = df.apply(
    lambda row: row['property_type'] if row['property_sub_type'] == 'Unknown' else row['property_sub_type'],
    axis=1
)

print(df['property_sub_type'].value_counts())

property_sub_type
Flat               1052621
Villa               295286
Land                142345
Commercial           87514
Hotel Apartment      40572
Building             33596
Other                   43
Name: count, dtype: int64

In [21]:
df.columns

Index(['transaction_id', 'procedure_id', 'trans_group_id', 'trans_group',
       'procedure_name', 'instance_date', 'property_type_id', 'property_type',
       'property_sub_type_id', 'property_sub_type', 'property_usage',
       'reg_type_id', 'reg_type', 'area_id', 'area_name', 'building_name',
       'project_number', 'project_name', 'master_project', 'nearest_landmark',
       'nearest_metro', 'nearest_mall', 'rooms', 'has_parking',
       'procedure_area', 'actual_worth', 'meter_sale_price', 'rent_value',
       'meter_rent_price', 'no_of_parties_role_1', 'no_of_parties_role_2',
       'no_of_parties_role_3', 'developer_name', 'is_near_metro',
       'is_near_mall', 'year', 'month', 'rooms_numeric'],
      dtype='object')

In [22]:
df['full_location'] = df['area_name'] + ", Dubai, United Arab Emirates"

In [23]:
df.to_csv('dubai_real_estate_data.csv', index=False)